**FREE

    dcl-pr Qp0zLprintf int(10) extproc(*CWIDEN:'Qp0zLprintf');
        format  pointer value options(*string); 
        s1      pointer value options(*string:*NOPASS);
        s2      pointer value options(*string:*NOPASS);
        s3      pointer value options(*string:*NOPASS);
        s4      pointer value options(*string:*NOPASS);
    end-pr;

